ХМНПФ_Общее/AccumulationRegisters/уп_СчетчикНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СчетчикНачислений</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/хм_СрезСчетчикНачисленийНПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>хм_СрезСчетчикНачисленийНПО</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СхемаСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СхемаСчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПенсии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыПенсионныхСхем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_РазмерПенсии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РазмерПенсии</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПолныйРазмер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_КоличествоНазначенныхВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_КоличествоНазначенныхВыплат</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоВыплат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_НачисленияПенсий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_НачисленияПенсий</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговаяБазаПоНДФЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДнейВПериоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчетаНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерваНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПенсии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыПенсионныхСхем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезерва</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСумм</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ЛицевыеСчетаУчастников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ЛицевыеСчетаУчастников</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормаВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ФормыВыплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеДействует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/хм_ПерваяВыплатаНПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>хм_ПерваяВыплатаНПО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Начислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Выплачено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПериодНачисленияПервойВыплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПенсионныйДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеДоговоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_Поступления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_Поступления</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ТипыПенсионныхСхем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ТипыПенсионныхСхем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СрочныхВыплат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПожизненныхВыплат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоИсчерпанияСредствНаСчете</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/CommonModules/уп_ОбщегоНазначенияУчетРезервов/Ext/Module.bsl
// +ХМНПФ 08.04.2021 ХлопцевБА // хм_ПерваяВыплатаНПО // №3086
&ИзменениеИКонтроль("СформироватьТЗНачисления")
Процедура НПФ_СформироватьТЗНачисления(Организация, ТЗДокумента, Периодичность, ТаблицаСчетов, ДатаФормированияДокументов, ПериодНачисления, ТЗОстаткиПоЗадолженности, ТаблицаДоплат)
	ДатаВПериоде = уп_НПФ.ОпределитьДатуВПериоде(ДатаФормированияДокументов,Периодичность,ПериодНачисления);
	ДатаКонцаПериода = уп_НПФ.ОпределитьДатуКонцаПериода(ПериодНачисления,Периодичность);
	ДатаНачалаПериода = уп_НПФ.ОпределитьДатуНачалаПериода(ПериодНачисления,Периодичность);
	
	#Вставка
	// +ХМНПФ 08.04.2021 ХлопцевБА // Последняя выплата // №3421
	ВыплачиватьОстатокВПоследнююПенсию = Ложь;  
	Если ТипЗнч(Организация) = Тип("Структура") Тогда 
		ВыплачиватьОстатокВПоследнююПенсию = Организация.ВыплачиватьОстатокВПоследнююПенсию;	
		Организация = Организация.Организация;	
	КонецЕсли;	
	ТаблицаСчетов.Колонки.Добавить("ЕстьПоступленияВзносов",    Новый ОписаниеТипов("Булево"));
	ТаблицаСчетов.Колонки.Добавить("ВыплачиватьОстатокВПоследнююПенсию",    Новый ОписаниеТипов("Булево"));
	#КонецВставки
	СписокСчетов = ТаблицаСчетов.ВыгрузитьКолонку("НомерСчета");
	СписокУчастников = ТаблицаСчетов.ВыгрузитьКолонку("Участник");
	#Вставка
	Если ВыплачиватьОстатокВПоследнююПенсию Тогда 
		тзПоступленийВзносов = ПолучитьПоступлениеВзнововЗаПериод(Организация,СписокСчетов,ДатаВПериоде); //
	Иначе    
		тзПоступленийВзносов = Новый ТаблицаЗначений;
		тзПоступленийВзносов.Колонки.Добавить("НомерСчетаУчастник");
		тзПоступленийВзносов.Колонки.Добавить("СуммаОборот");
	КонецЕсли;	
	// +ХМНПФ 08.04.2021 ХлопцевБА // Последняя выплата // №3421
	#КонецВставки
	
	//Бардошина +
	//текст запроса изменен: 
	//соединение с РС СведенияОДоплатах и с РН СчетчикДоплат,
	//соединение с РН уп_ЗадолженностьПоПенсиямОстатки (СуммаОстаток), суммируется с СуммаОстаток 
	//соединение с РН уп_ЗадолженностьПоПенсиямОбороты (СчетчикОборот), суммируется с КоличествоНачислений 
	//соединение с РН уп_ЗадолженностьПоПенсиямОбороты (СуммаПенсииПриход), суммируется с Начислено
	Запрос = Новый Запрос;   //здесь нужны не только остатки, но и обороты
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаДоплат.НомерСчета КАК НомерСчета,
	               |	ТаблицаДоплат.КоличествоНачисленныхДоплат КАК КоличествоНачисленныхДоплат
	               |ПОМЕСТИТЬ ТаблицаДоплатВходящая
	               |ИЗ
	               |	&ТаблицаДоплат КАК ТаблицаДоплат
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	              #Вставка
//++https://redmine.npf.com/issues/4274
//--	|			РегистрНакопления.уп_СчетчикНачислений.Обороты(&ДатаНачУчета, &ДатаПредПериода, Период, НомерСчета В (&СписокСчетов)) КАК уп_СчетчикНачисленийОбороты) КАК КолСделанныхВыплат
	|ВЫБРАТЬ
	|	уп_СчетчикНачислений.НомерСчета КАК НомерСчета,
	|	СУММА(уп_СчетчикНачислений.КоличествоОборот) КАК КоличествоОборот
	|ПОМЕСТИТЬ уп_СчетчикНачисленийОбороты
	|ИЗ
	|	(ВЫБРАТЬ
	|		уп_СчетчикНачислений.НомерСчета КАК НомерСчета,
	|		уп_СчетчикНачислений.Количество КАК КоличествоОборот
	|	ИЗ
	|		РегистрНакопления.уп_СчетчикНачислений КАК уп_СчетчикНачислений
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.хм_СрезСчетчикНачисленийНПО.СрезПоследних(&ДатаПредПериода, НомерСчета В (&СписокСчетов)) КАК хм_СрезСчетчик
	|			ПО уп_СчетчикНачислений.НомерСчета = хм_СрезСчетчик.НомерСчета
	|				И уп_СчетчикНачислений.Период < хм_СрезСчетчик.ДатаУстановкиСостояния
	|				И (хм_СрезСчетчик.ДатаУстановкиСостояния >= &ДатаНачУчета)
	|	ГДЕ
	|		уп_СчетчикНачислений.Период <= &ДатаПредПериода
	|	    И уп_СчетчикНачислений.НомерСчета В (&СписокСчетов)
	|		И уп_СчетчикНачислений.Период >= &ДатаНачУчета
	|		И хм_СрезСчетчик.ДатаУстановкиСостояния ЕСТЬ NULL
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		хм_СрезСчетчик.НомерСчета,
	|		хм_СрезСчетчик.Количество
	|	ИЗ
	|		РегистрСведений.хм_СрезСчетчикНачисленийНПО.СрезПоследних(&ДатаПредПериода, НомерСчета В (&СписокСчетов)) КАК хм_СрезСчетчик
	|	ГДЕ
	|		хм_СрезСчетчик.ДатаУстановкиСостояния >= &ДатаНачУчета
	|
	|) КАК уп_СчетчикНачислений
	|
	|СГРУППИРОВАТЬ ПО
	|	уп_СчетчикНачислений.НомерСчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСчета
	|;
	//--https://redmine.npf.com/issues/4274
	#КонецВставки
	               |ВЫБРАТЬ
	               |	СхемаСчетаСрезПоследних.НомерСчета КАК НомерСчета,
	               |	СхемаСчетаСрезПоследних.Схема КАК Схема,
	               |	ВЫБОР
	               |		КОГДА СхемаСчетаСрезПоследних.ТипПенсии = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.ПустаяСсылка)
	               |			ТОГДА СхемаСчетаСрезПоследних.Схема.ТипПенсионнойСхемы
	               |		ИНАЧЕ СхемаСчетаСрезПоследних.ТипПенсии
	               |	КОНЕЦ КАК ТипПенсии,
	               |	СхемаСчетаСрезПоследних.НомерСчета.Участник КАК НомерСчетаУчастник,
	#Вставка
	// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
	|	СхемаСчетаСрезПоследних.НомерСчета.Владелец.ПодразделениеБУ КАК НомерСчетаВладелецПодразделениеБУ,
	|	СхемаСчетаСрезПоследних.НомерСчета.Владелец КАК НомерСчетаВладелец,
	|	СхемаСчетаСрезПоследних.НомерСчета.Владелец.Родитель КАК НомерСчетаВладелецРодитель,
	#КонецВставки
	               |	ЕСТЬNULL(КоличествоНазначенныхВыплат.КоличествоВыплат, 0) КАК КоличествоВыплат,
	#Вставка
	// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_ПерваяВыплатаНПО // №3086
	|	ЕСТЬNULL(хм_ПерваяВыплатаНПО.Начислено,ЕСТЬNULL(ТабРазмерПенсий.Размер, 0)) КАК Размер,
	#КонецВставки
	#Удаление
	               |	ЕСТЬNULL(ТабРазмерПенсий.Размер, 0) КАК Размер,
	#КонецУдаления
	               |	ЛицевыеСчета.ТипЛицевогоСчета КАК ТипЛицевогоСчета,
	               |	ЛицевыеСчета.НомерЛицевогоСчета КАК НомерЛицевогоСчета,
	               |	ЛицевыеСчета.Банк КАК Банк,
	               |	ЕСТЬNULL(ОстаткиНаСчете.СуммаОстаток, 0) - ЕСТЬNULL(ЗадолженностьОстатки.СуммаПенсииОстаток, 0) КАК СуммаОстаток,
	               |	ТабНомерОчереди.НомерОчереди КАК НомерОчереди,
	               |	ЕСТЬNULL(ТабНачислений.СуммаОстаток, 0) + ЕСТЬNULL(ЗадолженностьТабНачислений.СуммаПенсииПриход, 0) КАК Начислено,
	               |	ЕСТЬNULL(КолСделанныхВыплат.КоличествоОборот, 0) + ЕСТЬNULL(ЗадолженностьСчетчик.СчетчикОборот, 0) КАК КоличествоНачислений,
	               |	СхемаСчетаСрезПоследних.НомерСчета.Владелец.Вкладчик КАК Вкладчик, 
	               |	СхемаСчетаСрезПоследних.НомерСчета.Владелец.Вкладчик.ЮридическоеФизическоеЛицо КАК ТипВкладчика, 
	               |	ЕСТЬNULL(СведенияОДоплатах.ДоплатаРазмер, 0) КАК ДоплатаРазмер,
	               |	ЕСТЬNULL(СведенияОДоплатах.ДоплатаКоличествоВыплат, 0) КАК ДоплатаКоличествоВыплат,
	               |	ЕСТЬNULL(уп_СчетчикДоплат.СчетчикОборот, 0) + ЕСТЬNULL(ЗадолженностьСчетчикДоплат.СчетчикОборот, 0) КАК ДоплатаКоличествоНачислений,
	               |	ЕСТЬNULL(ДоплатаТабНачислений.СуммаОборот, 0) + ЕСТЬNULL(ЗадолженностьТабНачислений.СуммаДоплатыПриход, 0) КАК ДоплатаНачислено,
	               |	ЕСТЬNULL(ТаблицаДоплатВходящая.КоличествоНачисленныхДоплат, 0) КАК КоличествоНачисленныхДоплат
	               |ИЗ
	               #Удаление
	               |	РегистрСведений.уп_СхемаСчета.СрезПоследних(&ДатаФормированияДокументов, НомерСчета В (&СписокСчетов)) КАК СхемаСчетаСрезПоследних
	               #КонецУдаления
	               #Вставка
   	               |	РегистрСведений.уп_СхемаСчета.СрезПоследних(&ДатаВПериоде, НомерСчета В (&СписокСчетов)) КАК СхемаСчетаСрезПоследних
	               #КонецВставки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			РазмерПенсииСрезПоследних.НомерСчета КАК НомерСчета,
	               |			РазмерПенсииСрезПоследних.Размер КАК Размер
	               |		ИЗ
	               |			РегистрСведений.уп_РазмерПенсии.СрезПоследних(&ДатаВПериоде, НомерСчета В (&СписокСчетов)) КАК РазмерПенсииСрезПоследних) КАК ТабРазмерПенсий
	               |		ПО СхемаСчетаСрезПоследних.НомерСчета = ТабРазмерПенсий.НомерСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			РезервыОстатки.НомерСчета КАК НомерСчета,
	               |			РезервыОстатки.СуммаОстаток КАК СуммаОстаток
	               |		ИЗ
	               |			РегистрНакопления.уп_Резервы.Остатки(
	               |					&ДатаФормированияДокументов,
	               |					НомерСчета В (&СписокСчетов)
	               |						И ТипРезерва В (&СписокТиповРезерва)) КАК РезервыОстатки) КАК ОстаткиНаСчете
	               |		ПО СхемаСчетаСрезПоследних.НомерСчета = ОстаткиНаСчете.НомерСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			НомераОчередейСрезПоследних.НомерСчета КАК НомерСчета,
	               |			НомераОчередейСрезПоследних.НомерОчереди КАК НомерОчереди
	               |		ИЗ
	               |			РегистрСведений.уп_НомераОчередей.СрезПоследних(&ДатаФормированияДокументов, НомерСчета В (&СписокСчетов)) КАК НомераОчередейСрезПоследних) КАК ТабНомерОчереди
	               |		ПО СхемаСчетаСрезПоследних.НомерСчета = ТабНомерОчереди.НомерСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			КоличествоВыплатСрезПоследних.НомерСчета КАК НомерСчета,
	               |			КоличествоВыплатСрезПоследних.КоличествоВыплат КАК КоличествоВыплат
	               |		ИЗ
	               |			РегистрСведений.уп_КоличествоНазначенныхВыплат.СрезПоследних(&ДатаВПериоде, НомерСчета В (&СписокСчетов)) КАК КоличествоВыплатСрезПоследних) КАК КоличествоНазначенныхВыплат
	               |		ПО СхемаСчетаСрезПоследних.НомерСчета = КоличествоНазначенныхВыплат.НомерСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			НачисленияПенсийОбороты.НомерСчета КАК НомерСчета,
	               |			НачисленияПенсийОбороты.СуммаПриход КАК СуммаОстаток
	               |		ИЗ
	               |			РегистрНакопления.уп_НачисленияПенсий.Обороты(
	               |					,
	               |					&ДатаФормированияДокументовКонецДня,
	               |					Период,
	               |					НомерСчета В (&СписокСчетов)
	               |						И КонПериода <= &ДатаКонцаПериода
	               |						И НачПериода >= &ДатаНачалаПериода) КАК НачисленияПенсийОбороты) КАК ТабНачислений
	               |		ПО СхемаСчетаСрезПоследних.НомерСчета = ТабНачислений.НомерСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЛицевыеСчетаУчастниковСрезПоследних.ТипЛицевогоСчета КАК ТипЛицевогоСчета,
	               |			ЛицевыеСчетаУчастниковСрезПоследних.НомерЛицевогоСчета КАК НомерЛицевогоСчета,
	               |			ЛицевыеСчетаУчастниковСрезПоследних.Банк КАК Банк,
	               |			ЛицевыеСчетаУчастниковСрезПоследних.НомерСчета КАК НомерСчета,
	               |			ЛицевыеСчетаУчастниковСрезПоследних.Участник КАК Участник
	               |		ИЗ
	               |			РегистрСведений.уп_ЛицевыеСчетаУчастников.СрезПоследних(
	               |					&ДатаФормированияДокументов,
	               |					НомерСчета В (&СписокСчетов)
	               |						И Организация = &Организация) КАК ЛицевыеСчетаУчастниковСрезПоследних) КАК ЛицевыеСчета
	               |		ПО СхемаСчетаСрезПоследних.НомерСчета = ЛицевыеСчета.НомерСчета
	               |			И СхемаСчетаСрезПоследних.НомерСчета.Участник = ЛицевыеСчета.Участник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			уп_СчетчикНачисленийОбороты.НомерСчета КАК НомерСчета,
	               |			уп_СчетчикНачисленийОбороты.КоличествоОборот КАК КоличествоОборот
	               |		ИЗ
	               #Удаление
	               |			РегистрНакопления.уп_СчетчикНачислений.Обороты(&ДатаНачУчета, &ДатаПредПериода, Период, НомерСчета В (&СписокСчетов)) КАК уп_СчетчикНачисленийОбороты) КАК КолСделанныхВыплат
	               #КонецУдаления
	               #Вставка
	               //++https://redmine.npf.com/issues/4274
	               |			уп_СчетчикНачисленийОбороты КАК уп_СчетчикНачисленийОбороты) КАК КолСделанныхВыплат
			       //--https://redmine.npf.com/issues/4274
	               #КонецВставки
	               |		ПО СхемаСчетаСрезПоследних.НомерСчета = КолСделанныхВыплат.НомерСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			npo_СведенияОДоплатахСрезПоследних.НомерСчета КАК НомерСчета,
	               |			npo_СведенияОДоплатахСрезПоследних.РазмерДоплаты КАК ДоплатаРазмер,
	               |			npo_СведенияОДоплатахСрезПоследних.ОбщееКоличествоВыплат КАК ДоплатаКоличествоВыплат
	               |		ИЗ
	               |			РегистрСведений.уп_СведенияОДоплатах.СрезПоследних(&ДатаВПериоде, НомерСчета В (&СписокСчетов)) КАК npo_СведенияОДоплатахСрезПоследних) КАК СведенияОДоплатах
	               |		ПО СхемаСчетаСрезПоследних.НомерСчета = СведенияОДоплатах.НомерСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			СчетчикДоплатОбороты.НомерСчета КАК НомерСчета,
	               |			СчетчикДоплатОбороты.СчетчикОборот КАК СчетчикОборот
	               |		ИЗ
	               |			РегистрНакопления.уп_СчетчикДоплат.Обороты(&ДатаНачУчета, &ДатаПредПериода, Период, НомерСчета В (&СписокСчетов)) КАК СчетчикДоплатОбороты) КАК уп_СчетчикДоплат
	               |		ПО СхемаСчетаСрезПоследних.НомерСчета = уп_СчетчикДоплат.НомерСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			СчетчикДоплатОбороты.НомерСчета КАК НомерСчета,
	               |			СчетчикДоплатОбороты.СуммаОборот КАК СуммаОборот
	               |		ИЗ
	               |			РегистрНакопления.уп_СчетчикДоплат.Обороты(
	               |					,
	               |					&ДатаФормированияДокументовКонецДня,
	               |					Период,
	               |					НомерСчета В (&СписокСчетов)
	               |						И КонПериода <= &ДатаКонцаПериода
	               |						И НачПериода >= &ДатаНачалаПериода) КАК СчетчикДоплатОбороты) КАК ДоплатаТабНачислений
	               |		ПО СхемаСчетаСрезПоследних.НомерСчета = ДоплатаТабНачислений.НомерСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЗадолженностьПоПенсиямОстатки.НомерСчета КАК НомерСчета,
	               |			ЗадолженностьПоПенсиямОстатки.СуммаПенсииОстаток КАК СуммаПенсииОстаток
	               |		ИЗ
	               |			РегистрНакопления.уп_ЗадолженностьПоПенсиям.Остатки(&ДатаФормированияДокументов, НомерСчета В (&СписокСчетов)) КАК ЗадолженностьПоПенсиямОстатки) КАК ЗадолженностьОстатки
	               |		ПО СхемаСчетаСрезПоследних.НомерСчета = ЗадолженностьОстатки.НомерСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЗадолженностьПоПенсиямОбороты.НомерСчета КАК НомерСчета,
	               |			ЗадолженностьПоПенсиямОбороты.СчетчикОборот КАК СчетчикОборот
	               |		ИЗ
	               |			РегистрНакопления.уп_ЗадолженностьПоПенсиям.Обороты(&ДатаНачУчета, &ДатаПредПериода, Период, НомерСчета В (&СписокСчетов)) КАК ЗадолженностьПоПенсиямОбороты) КАК ЗадолженностьСчетчик
	               |		ПО СхемаСчетаСрезПоследних.НомерСчета = ЗадолженностьСчетчик.НомерСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЗадолженностьПоПенсиямОбороты.НомерСчета КАК НомерСчета,
	               |			ЗадолженностьПоПенсиямОбороты.СуммаПенсииПриход КАК СуммаПенсииПриход,
	               |			ЗадолженностьПоПенсиямОбороты.СуммаДоплатыПриход КАК СуммаДоплатыПриход
	               |		ИЗ
	               |			РегистрНакопления.уп_ЗадолженностьПоПенсиям.Обороты(
	               |					,
	               |					&ДатаФормированияДокументовКонецДня,
	               |					Период,
	               |					НомерСчета В (&СписокСчетов)
	               |						И КонецПериода <= &ДатаКонцаПериода
	               |						И НачалоПериода >= &ДатаНачалаПериода) КАК ЗадолженностьПоПенсиямОбороты) КАК ЗадолженностьТабНачислений
	               |		ПО СхемаСчетаСрезПоследних.НомерСчета = ЗадолженностьТабНачислений.НомерСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЗадолженностьПоПенсиямОбороты.НомерСчета КАК НомерСчета,
	               |			ЗадолженностьПоПенсиямОбороты.СчетчикОборот КАК СчетчикОборот,
	               |			ЗадолженностьПоПенсиямОбороты.СуммаДоплатыОборот КАК СуммаДоплатыОборот
	               |		ИЗ
	               |			РегистрНакопления.уп_ЗадолженностьПоПенсиям.Обороты(&ДатаНачУчета, &ДатаПредПериода, Период, НомерСчета В (&СписокСчетов)) КАК ЗадолженностьПоПенсиямОбороты
	               |		ГДЕ
	               |			ЗадолженностьПоПенсиямОбороты.СуммаДоплатыОборот > 0) КАК ЗадолженностьСчетчикДоплат
	               |		ПО СхемаСчетаСрезПоследних.НомерСчета = ЗадолженностьСчетчикДоплат.НомерСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДоплатВходящая КАК ТаблицаДоплатВходящая
	               #Удаление
	               |		ПО СхемаСчетаСрезПоследних.НомерСчета = ТаблицаДоплатВходящая.НомерСчета";
	               #КонецУдаления
	               #Вставка
	               |		ПО СхемаСчетаСрезПоследних.НомерСчета = ТаблицаДоплатВходящая.НомерСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			хм_ПерваяВыплатаНПО.НомерСчета КАК НомерСчета,
	               |			хм_ПерваяВыплатаНПО.Начислено КАК Начислено
	               |		ИЗ
	               |			РегистрСведений.хм_ПерваяВыплатаНПО КАК хм_ПерваяВыплатаНПО
	               |		ГДЕ
	               |			хм_ПерваяВыплатаНПО.НомерСчета В(&СписокСчетов) И хм_ПерваяВыплатаНПО.ПериодНачисленияПервойВыплаты = &ПериодНачисления) КАК хм_ПерваяВыплатаНПО
	               |		ПО СхемаСчетаСрезПоследних.НомерСчета = хм_ПерваяВыплатаНПО.НомерСчета";
	               #КонецВставки
	//Бардошина -
	#Вставка
	// +ХМНПФ 08.04.2021 ХлопцевБА // хм_ПерваяВыплатаНПО // №3086
	// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_ПерваяВыплатаНПО // №3086
	Запрос.УстановитьПараметр("ПериодНачисления", ПериодНачисления);
	#КонецВставки
	
	//Запрос.УстановитьПараметр("ДатаВПериоде", ДатаВПериоде);
	Запрос.УстановитьПараметр("ДатаВПериоде", ДатаКонцаПериода);
	Запрос.УстановитьПараметр("ДатаФормированияДокументов", ДатаФормированияДокументов);
	Запрос.УстановитьПараметр("ДатаФормированияДокументовКонецДня", КонецДня(ДатаФормированияДокументов));
	Запрос.УстановитьПараметр("ДатаНачалаПериода", ДатаНачалаПериода);
	Запрос.УстановитьПараметр("ДатаКонцаПериода", ДатаКонцаПериода);
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
	Запрос.УстановитьПараметр("СписокУчастников", СписокУчастников);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачУчета", '19900101');
	Запрос.УстановитьПараметр("ДатаПредПериода", ПериодНачисления-1);
	
	СписокТиповРезерва = Новый СписокЗначений;
	СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезерва.ИПС);
	СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезерва.СПС);
	СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезерва.ПожизненныхВыплат);
	Запрос.УстановитьПараметр("СписокТиповРезерва", СписокТиповРезерва);
	
	ТаблицаДоплат.Свернуть("НомерСчета", "КоличествоНачисленныхДоплат");
	Запрос.УстановитьПараметр("ТаблицаДоплат", ТаблицаДоплат);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	#Вставка
	// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
	Если ТЗДокумента.Колонки.Найти("Участник") = Неопределено Тогда
		ТЗДокумента.Колонки.Добавить("Участник");
	КонецЕсли;
	ТаблицаСчетов.Индексы.Добавить("НомерСчета");
	тзПоступленийВзносов.Индексы.Добавить("НомерСчетаУчастник");
	Если ТЗОстаткиПоЗадолженности <> Неопределено Тогда
		ТЗОстаткиПоЗадолженности.Индексы.Добавить("НомерСчета");
	КонецЕсли;
	хм_Ускорение = Новый Структура("АлгоритмРасчетаПенсии",Перечисления.уп_АлгоритмРасчетаПенсии.Основной);
	#КонецВставки
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицыПС = ТаблицаСчетов.Найти(Выборка.НомерСчета, "НомерСчета");
		Если СтрокаТаблицыПС<>Неопределено Тогда
			#Вставка
			// +ХМНПФ 08.04.2021 ХлопцевБА // Последняя выплата // №3421
			СтрокаПоступлений = тзПоступленийВзносов.Найти(Выборка.НомерСчета, "НомерСчетаУчастник");
			
			Если СтрокаПоступлений <> Неопределено Тогда
				СтрокаТаблицыПС.ЕстьПоступленияВзносов = Истина;
			Иначе
				СтрокаТаблицыПС.ЕстьПоступленияВзносов = Ложь;
			КонецЕсли;
			
			СтрокаТаблицыПС.ВыплачиватьОстатокВПоследнююПенсию = ВыплачиватьОстатокВПоследнююПенсию;
			// +ХМНПФ 08.04.2021 ХлопцевБА // Последняя выплата // №3421,3730
			#КонецВставки
			
			Если НЕ ТаблицаСчетов.Колонки.Найти("НомерНачисления") = Неопределено Тогда
				НомерНачисления = СтрокаТаблицыПС.НомерНачисления - 1;
				Если НомерНачисления<0 Тогда
					НомерНачисления = 0;
				КонецЕсли;	
			Иначе
				НомерНачисления = 0;
			КонецЕсли;
			
			//Бардошина +
			//начисление за пропущенные периоды тем, кому было сделано восстановление выплат (наличие остатков в РН "Задолженность по пенсиям")
			Если ТЗОстаткиПоЗадолженности <> Неопределено Тогда
				МассивСтрок = ТЗОстаткиПоЗадолженности.НайтиСтроки(Новый Структура("НомерСчета", Выборка.НомерСчета));
				Для каждого Стр Из МассивСтрок Цикл
					ТекСтрокаТЗДокумента = ТЗДокумента.Добавить();
					ТекСтрокаТЗДокумента.НомерСчета = Выборка.НомерСчета;
					ТекСтрокаТЗДокумента.Вкладчик = Выборка.Вкладчик; 
					ТекСтрокаТЗДокумента.ТипВкладчика = Выборка.ТипВкладчика; 
					#Удаление
					ТекСтрокаТЗДокумента.ПодразделениеБУ = Выборка.НомерСчета.Владелец.ПодразделениеБУ;
					#КонецУдаления
					#Вставка
					// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
					ТекСтрокаТЗДокумента.ПодразделениеБУ = Выборка.НомерСчетаВладелецПодразделениеБУ;
					ТекСтрокаТЗДокумента.Участник = Выборка.НомерСчетаУчастник;
					// -ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
					#КонецВставки
					ТекСтрокаТЗДокумента.Схема = Выборка.Схема;
					ТекСтрокаТЗДокумента.ТипПенсии = Выборка.ТипПенсии;
					ТекСтрокаТЗДокумента.НачалоПериода = Стр.НачалоПериода;
					ТекСтрокаТЗДокумента.КонецПериода =  Стр.КонецПериода;
					ТекСтрокаТЗДокумента.Пенсия = Стр.Сумма - Стр.Доплата;
					ТекСтрокаТЗДокумента.Доплата = Стр.Доплата;
					ТекСтрокаТЗДокумента.Сумма = Стр.Сумма;
					ТекСтрокаТЗДокумента.ПоследняяВыплата = Ложь;
					ТекСтрокаТЗДокумента.Получатель = Выборка.Банк;
					#Удаление
					ТекСтрокаТЗДокумента.ПенсионныйДоговор = Выборка.НомерСчета.Владелец;
					ТекСтрокаТЗДокумента.ГруппаДоговора = Выборка.НомерСчета.Владелец.Родитель;
					#КонецУдаления
					#Вставка
					// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
					ТекСтрокаТЗДокумента.ПенсионныйДоговор = Выборка.НомерСчетаВладелец;
					ТекСтрокаТЗДокумента.ГруппаДоговора = Выборка.НомерСчетаВладелецРодитель;
					// -ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
					#КонецВставки
					ТекСтрокаТЗДокумента.ОчередностьВыплаты = Выборка.НомерОчереди;
					ТекСтрокаТЗДокумента.Периодичность = Периодичность;
					ТекСтрокаТЗДокумента.ЭтоЗадолженность = Ложь;
					ТекСтрокаТЗДокумента.ЭтоВосстановлениеЗадолженности = Истина;
					//СтрокаТаблицыПС.НачисленоРаннее = СтрокаТаблицыПС.НачисленоРаннее + Стр.Сумма;
					//НомерНачисления = НомерНачисления+1;
				КонецЦикла;
			КонецЕсли;
			#Вставка
			ЕстьОборот = Ложь;
			#КонецВставки
			//Бардошина -
			//РассчитатьПенсиюПоТаблице(ТЗДокумента, Выборка, ИСТИНА, ПериодНачисления, ДатаКонцаПериода, СтрокаТаблицыПС.Период, Периодичность);
			//РассчитатьПенсиюПоТаблице(ТЗДокумента, Выборка, ИСТИНА, ПериодНачисления, ДатаКонцаПериода, СтрокаТаблицыПС, НомерНачисления, Периодичность);
			РассчитатьПенсиюПоТаблице(ТЗДокумента, Выборка, ИСТИНА, ДатаНачалаПериода, ДатаКонцаПериода, СтрокаТаблицыПС, НомерНачисления, Периодичность, ТаблицаДоплат);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&ИзменениеИКонтроль("РассчитатьПенсиюПоТаблице")
	// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
Процедура НПФ_РассчитатьПенсиюПоТаблице(ТЗДокумента, СтрокаТЗ, РежимОтладки, НачПериода, КонПериода, СтрокаТаблицыПС, НомерНачисления, Периодичность, ТаблицаДоплат, хм_Ускорение = Неопределено)
	ДатаНачалаВыплатногоПериода = СтрокаТаблицыПС.Период;
	НачисленоРаннее = СтрокаТаблицыПС.НачисленоРаннее;
	#Вставка
	// +ХМНПФ 08.04.2021 ХлопцевБА // Последняя выплата // №3730 
	ВыплачиватьОстатокВПоследнююПенсию  = СтрокаТаблицыПС.ВыплачиватьОстатокВПоследнююПенсию;
	// -ХМНПФ 08.04.2021 ХлопцевБА // Последняя выплата // №3730 
	#КонецВставки
	Схема = СтрокаТЗ.Схема;
	ТипВыплаты = СтрокаТЗ.ТипПенсии; 
	ПоследняяВыплата = Ложь;
	#Удаление
	Если Схема.АлгоритмРасчетаПенсии = Перечисления.уп_АлгоритмРасчетаПенсии.Основной Тогда
	#КонецУдаления
	#Вставка
	// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
	Если (НЕ хм_Ускорение = Неопределено И Схема.АлгоритмРасчетаПенсии = хм_Ускорение.АлгоритмРасчетаПенсии) ИЛИ (хм_Ускорение = Неопределено И Схема.АлгоритмРасчетаПенсии = Перечисления.уп_АлгоритмРасчетаПенсии.Основной) Тогда
	#КонецВставки
		
		//Бардошина +
		//начисление доплат
		//КолОстВыплатДоплата = СтрокаТЗ.ДоплатаКоличествоВыплат-СтрокаТЗ.ДоплатаКоличествоНачислений - НомерНачисления;
		КолОстВыплатДоплата = СтрокаТЗ.ДоплатаКоличествоВыплат-СтрокаТЗ.ДоплатаКоличествоНачислений - СтрокаТЗ.КоличествоНачисленныхДоплат;
		Если КолОстВыплатДоплата<=0 Тогда
			КолОстВыплатДоплата = 0;
		КонецЕсли;
		РазмерДоплаты = СтрокаТЗ.ДоплатаРазмер;
		НачисленоРанееЗаЭтотПериод = ?(СтрокаТЗ.ДоплатаНачислено = Null, 0, СтрокаТЗ.ДоплатаНачислено);
		СуммаДоплаты =  РазмерДоплаты - НачисленоРанееЗаЭтотПериод;
		Если КолОстВыплатДоплата = 0 Тогда                                     
			СуммаДоплаты = 0;
		Иначе
			НовСтрТаблицыДоплат = ТаблицаДоплат.Добавить();
			НовСтрТаблицыДоплат.НомерСчета = СтрокаТЗ.НомерСчета;
			НовСтрТаблицыДоплат.КоличествоНачисленныхДоплат = 1;
		КонецЕсли;
		//определим средства, выделенные на доплаты - надо при расчетном размере срочной выплаты
		СредстваДляДоплаты = СуммаДоплаты*КолОстВыплатДоплата;
		//обнулим на случай, если тип пенсионной схемы не указан
		ВсегоНачислить = 0;
		//ОПА НПО 2018.03.15 -
		Если ТипВыплаты = Перечисления.уп_ТипыПенсионныхСхем.СрочныхВыплат Тогда
		#Вставка
//Пример счета 0000-00-00357 в схеме СрочныхВыплат в типе выплаты ДоИсчерпанияСредствНаСчете
//		Если Схема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.СрочныхВыплат Тогда
		#КонецВставки
			//КолОстВыплат = уп_ОбщегоНазначенияУчетРезервов.РасчетКоличестваОставшихсяВыплат(СтрокаТЗ.КоличествоВыплат, СтрокаТЗ.Период, НачПериода, Периодичность);
			//КолОстВыплат = СтрокаТЗ.КоличествоВыплат-СтрокаТЗ.КоличествоНачислений;
			//СуммаНаСчете = ?(СтрокаТЗ.СуммаОстаток = Null, 0, СтрокаТЗ.СуммаОстаток);
			КолОстВыплат = СтрокаТЗ.КоличествоВыплат-СтрокаТЗ.КоличествоНачислений - НомерНачисления;
			СуммаНаСчете = ?(СтрокаТЗ.СуммаОстаток = Null, 0, СтрокаТЗ.СуммаОстаток) - НачисленоРаннее;
			//Сообщить("Счет "+СтрокаТЗ.НомерСчета+" кол ост выплат "+КолОстВыплат+" сумма на счете "+СтрокаТЗ.СуммаОстаток);
			#Удаление
			Если КолОстВыплат<=0 и СуммаНаСчете<>0 Тогда 
			#КонецУдаления
			#Вставка
			// +ХМНПФ 25.12.2024 ЛытинкАМ // Закончились выплаты и ЛОЖЬ
			Если КолОстВыплат<=0 и СуммаНаСчете<>0 и ЛОЖЬ Тогда 
			#КонецВставки
				КолОстВыплат = 1;
				ПоследняяВыплата = Истина;
			ИначеЕсли КолОстВыплат<=0 Тогда
				КолОстВыплат = 0;
			КонецЕсли;
			Если Схема.ФиксированныеВыплаты Тогда
				//СуммаНаСчете = ?(СтрокаТЗ.СуммаОстаток = Null, 0, СтрокаТЗ.СуммаОстаток);
				РазмерПенсии = СтрокаТЗ.Размер;
				НачисленоРанееЗаЭтотПериод = ?(СтрокаТЗ.Начислено = Null, 0, СтрокаТЗ.Начислено)-?(СтрокаТЗ.ДоплатаНачислено = Null, 0, СтрокаТЗ.ДоплатаНачислено); //Бардошина+-
				ВсегоНачислить =  РазмерПенсии - НачисленоРанееЗаЭтотПериод;
				#Удаление
				Если (КолОстВыплат = 1) и (СуммаНаСчете>0) Тогда 
				#КонецУдаления
				#Вставка
				// +ХМНПФ 08.04.2021 ХлопцевБА // Последняя выплата // №3086
				Если (КолОстВыплат = 1) и (СуммаНаСчете>0) и  НЕ СтрокаТаблицыПС.ЕстьПоступленияВзносов Тогда 
				#КонецВставки
					Если СуммаДоплаты <> 0 Тогда
						СуммаДоплатыИсх = СуммаДоплаты;
						СуммаДоплаты = Мин(СуммаНаСчете - ВсегоНачислить, СуммаДоплаты);
						Если СуммаДоплаты < 0 Тогда
							СуммаДоплаты = 0;
							Сообщить("По счету №"+ СтрокаТЗ.НомерСчета +" доплата за период "+Формат(НачПериода,"ДЛФ=D")+"-"+Формат(КонПериода,"ДЛФ=D")+" не начислена (недостаточно средств на счете).");
						ИначеЕсли СуммаДоплатыИсх > СуммаДоплаты Тогда  
							Сообщить("По счету №"+ СтрокаТЗ.НомерСчета +" доплата за период "+Формат(НачПериода,"ДЛФ=D")+"-"+Формат(КонПериода,"ДЛФ=D")+" начислена не в полном размере (недостаточно средств на счете).");
						КонецЕсли;
						ВсегоНачислить = СуммаНаСчете - СуммаДоплаты;
					Иначе	
						#Вставка
						Если ВыплачиватьОстатокВПоследнююПенсию Тогда 
						#КонецВставки
							ВсегоНачислить = СуммаНаСчете;               
						#Вставка
						Иначе
							ВсегоНачислить = Мин(РазмерПенсии,СуммаНаСчете);
						КонецЕсли;
						#КонецВставки
					КонецЕсли;
					//Бардошина -
					#Вставка
					// +ХМНПФ 08.04.2021 ХлопцевБА // Последняя выплата // №3086
				ИначеЕсли (КолОстВыплат = 1) и (СуммаНаСчете>0) и  СтрокаТаблицыПС.ЕстьПоступленияВзносов Тогда
					ВсегоНачислить = Мин(СуммаНаСчете,РазмерПенсии);
					#КонецВставки
				ИначеЕсли КолОстВыплат = 0 Тогда
					ВсегоНачислить = 0;
				КонецЕсли;
				Если СтрокаТаблицыПС.ЭтоЗадолженность И КолОстВыплат = 1 И НачисленоРанееЗаЭтотПериод <> РазмерПенсии
					И СтрокаТЗ.СуммаОстаток = 0 Тогда
					ВсегоНачислить = 0;
				КонецЕсли;	
			Иначе
				//СуммаНаСчете = ?(СтрокаТЗ.СуммаОстаток = Null, 0, СтрокаТЗ.СуммаОстаток);
				Если КолОстВыплат = 0 Тогда
					РазмерПенсии = 0;
				Иначе
					РазмерПенсии = (СуммаНаСчете-СредстваДляДоплаты)/КолОстВыплат;
				КонецЕсли;
				НачисленоРанееЗаЭтотПериод = ?(СтрокаТЗ.Начислено = Null, 0, СтрокаТЗ.Начислено)-?(СтрокаТЗ.ДоплатаНачислено = Null, 0, СтрокаТЗ.ДоплатаНачислено); //Бардошина+-
				Если  НачисленоРанееЗаЭтотПериод > 0 Тогда
					РазмерПенсии = 0;
				КонецЕсли;
				ВсегоНачислить = РазмерПенсии;
			КонецЕсли;
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат Тогда
		#Вставка
//Пример счета 0000-00-00357 в схеме СрочныхВыплат в типе выплаты ДоИсчерпанияСредствНаСчете
//		ИначеЕсли Схема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат Тогда
		#КонецВставки
			РазмерПенсии = СтрокаТЗ.Размер;
			НачисленоРанееЗаЭтотПериод = ?(СтрокаТЗ.Начислено = Null, 0, СтрокаТЗ.Начислено);
			ВсегоНачислить =  РазмерПенсии - НачисленоРанееЗаЭтотПериод;
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыПенсионныхСхем.ДоИсчерпанияСредствНаСчете Тогда
		#Вставка
//Пример счета 0000-00-00357 в схеме СрочныхВыплат в типе выплаты ДоИсчерпанияСредствНаСчете
//		ИначеЕсли Схема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.ДоИсчерпанияСредствНаСчете Тогда
		#КонецВставки
			РазмерПенсии = СтрокаТЗ.Размер;
			//СуммаНаСчете = СтрокаТЗ.СуммаОстаток;
			СуммаНаСчете = СтрокаТЗ.СуммаОстаток - НачисленоРаннее;
			НачисленоРанееЗаЭтотПериод = ?(СтрокаТЗ.Начислено = Null, 0, СтрокаТЗ.Начислено);
			ВсегоНачислить =  РазмерПенсии - НачисленоРанееЗаЭтотПериод;
			Если (ВсегоНачислить>=СуммаНаСчете) и (ВсегоНачислить>0) Тогда
				ВсегоНачислить = СуммаНаСчете;
				ПоследняяВыплата = Истина;
			КонецЕсли;
			//Бардошина +
			Если (ВсегоНачислить+СуммаДоплаты)>СуммаНаСчете И СуммаДоплаты>0 И ВсегоНачислить>0 Тогда
				СуммаДоплаты = СуммаНаСчете - ВсегоНачислить;
				Сообщить("По счету №"+ СтрокаТЗ.НомерСчета +" доплата за период "+Формат(НачПериода,"ДЛФ=D")+"-"+Формат(КонПериода,"ДЛФ=D")+" начислена не в полном размере (недостаточно средств на счете).");
			КонецЕсли;	
			//Бардошина -
		Иначе
			#Удаление
			Сообщить("По счету №"+ СтрокаТЗ.НомерСчета +" для схемы "+Схема+" не заполен ""Тип пенсионной схемы/ тип выплаты"". По счету невозможен расчет!");
			#КонецУдаления
			#Вставка
			Сообщить("По счету №"+ СтрокаТЗ.НомерСчета +" для схемы "+Схема+" не заполен ""Тип пенсионной схемы"". По счету невозможен расчет!");
			#КонецВставки
		КонецЕсли;
		
		//Бардошина +
		//СтрокаТаблицыПС.НачисленоРаннее = НачисленоРаннее + ВсегоНачислить;
		//начисление доплат
		Если ВсегоНачислить <> 0 И ВсегоНачислить = СуммаНаСчете И СуммаДоплаты <> 0  Тогда
			СуммаДоплаты = 0;
			Сообщить("По счету №"+ СтрокаТЗ.НомерСчета +" не достаточно средств для начисления доплаты за период "+Формат(НачПериода,"ДЛФ=D")+"-"+Формат(КонПериода,"ДЛФ=D")+".");
		КонецЕсли;	
		Если ВсегоНачислить=0 И СуммаДоплаты<>0 Тогда
			СуммаДоплаты = 0;
			Сообщить("По счету № "+ СтрокаТЗ.НомерСчета + " не начислена пенсия за период "+Формат(НачПериода, "ДЛФ=D")+"-"+Формат(КонПериода, "ДЛФ=D")+", а количество оставшихся доплат составляет " + КолОстВыплатДоплата);
		КонецЕсли;	
		СтрокаТаблицыПС.НачисленоРаннее = НачисленоРаннее + ВсегоНачислить + СуммаДоплаты;
		//Бардошина -
	Иначе
		уп_ОбщегоНазначенияУчетРезервов.АльтернативныйРасчет(ТЗДокумента, СтрокаТЗ, РежимОтладки=ЛОЖЬ, НачПериода, КонПериода, ДатаНачалаВыплатногоПериода, Периодичность);
		Возврат;
	КонецЕсли;
	//Бардошина +
	Если ВсегоНачислить + СуммаДоплаты <0 Тогда 
		#Удаление
		Сообщить("Начисленная сумма по счету № "+СокрЛП(СтрокаТЗ.НомерСчета.Наименование)+" меньше 0 и равна "+Окр(ВсегоНачислить,2));//+" необходимо вручную скорректировать последующие начисления на эту сумму.");
		#КонецУдаления
		#Вставка
		// +ХМНПФ 22.12.2021 ХлопцевБА // измененно для больше иформативности (С.Рустанова)
		Сообщить("Начисленная сумма по счету № "+СокрЛП(СтрокаТЗ.НомерСчета)+" меньше 0 и равна "+ВсегоНачислить);//+" необходимо вручную скорректировать последующие начисления на эту сумму.");
		#КонецВставки
		//Бардошина -
	КонецЕсли;
	Если ВсегоНачислить<>0 Тогда
		ТекСтрокаТЗДокумента = ТЗДокумента.Добавить();
		ТекСтрокаТЗДокумента.НомерСчета = СтрокаТЗ.НомерСчета;
		ТекСтрокаТЗДокумента.Вкладчик = СтрокаТЗ.Вкладчик;
		ТекСтрокаТЗДокумента.ТипВкладчика = СтрокаТЗ.ТипВкладчика;
		#Вставка
		// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
		Если НЕ хм_Ускорение = Неопределено Тогда
			ТекСтрокаТЗДокумента.ПодразделениеБУ = СтрокаТЗ.НомерСчетаВладелецПодразделениеБУ;
			ТекСтрокаТЗДокумента.Участник = СтрокаТЗ.НомерСчетаУчастник;
		Иначе
		#КонецВставки
		ТекСтрокаТЗДокумента.ПодразделениеБУ = СтрокаТЗ.НомерСчета.Владелец.ПодразделениеБУ;
		#Вставка
		КонецЕсли;
		#КонецВставки
		ТекСтрокаТЗДокумента.Схема = СтрокаТЗ.Схема;
		ТекСтрокаТЗДокумента.ТипПенсии = СтрокаТЗ.ТипПенсии;
		#Удаление
		ТекСтрокаТЗДокумента.НачалоПериода = ?(ДатаНачалаВыплатногоПериода>НачПериода, НачалоДня(ДатаНачалаВыплатногоПериода), НачПериода);
		#КонецУдаления
		#Вставка
		// +ХМНПФ 22.12.2021 ХлопцевБА // // № 3453
		ТекСтрокаТЗДокумента.НачалоПериода = НачПериода;
		// +ХМНПФ 22.12.2021 ХлопцевБА // 
		#КонецВставки
		ТекСтрокаТЗДокумента.КонецПериода =  КонПериода;
		ТекСтрокаТЗДокумента.Пенсия = ВсегоНачислить;
		//Бардошина +
		ТекСтрокаТЗДокумента.Доплата = СуммаДоплаты;
		ТекСтрокаТЗДокумента.Сумма = ВсегоНачислить + СуммаДоплаты;
		//Бардошина -
		ТекСтрокаТЗДокумента.ПоследняяВыплата = ПоследняяВыплата;
		ТекСтрокаТЗДокумента.Получатель = СтрокаТЗ.Банк;
		#Вставка
		// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
		Если НЕ хм_Ускорение = Неопределено Тогда
			ТекСтрокаТЗДокумента.ПенсионныйДоговор = СтрокаТЗ.НомерСчетаВладелец;
		Иначе
		#КонецВставки
		ТекСтрокаТЗДокумента.ПенсионныйДоговор = СтрокаТЗ.НомерСчета.Владелец;
		#Вставка
		КонецЕсли;
		// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
		Если НЕ хм_Ускорение = Неопределено Тогда
			ТекСтрокаТЗДокумента.ГруппаДоговора = СтрокаТЗ.НомерСчетаВладелецРодитель;
		Иначе
		#КонецВставки
		ТекСтрокаТЗДокумента.ГруппаДоговора = СтрокаТЗ.НомерСчета.Владелец.Родитель;
		#Вставка
		КонецЕсли;
		#КонецВставки
		ТекСтрокаТЗДокумента.ОчередностьВыплаты = СтрокаТЗ.НомерОчереди;
		ТекСтрокаТЗДокумента.Периодичность = Периодичность;
		ТекСтрокаТЗДокумента.ЭтоЗадолженность = СтрокаТаблицыПС.ЭтоЗадолженность; //Бардошина +- 
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьПоступлениеВзнововЗаПериод(Организация,мСписокСчетов,ДатаВПериоде)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уп_ПоступленияОбороты.НомерСчета КАК НомерСчетаУчастник,
	|	уп_ПоступленияОбороты.СуммаОборот КАК СуммаОборот
	|ИЗ
	|	РегистрНакопления.уп_Поступления.Обороты(
	|			&НачПериода,
	|			&КонПериода,
	|			Период,
	|			Организация = &Организация
	|				И НомерСчета В (&мСписокСчетов)) КАК уп_ПоступленияОбороты";
	
	Запрос.УстановитьПараметр("КонПериода", КонецМесяца(ДатаВПериоде));
	Запрос.УстановитьПараметр("мСписокСчетов", мСписокСчетов);
	Запрос.УстановитьПараметр("НачПериода", НачалоГода(ДатаВПериоде));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	тзРезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат(тзРезультатЗапроса);	
	
КонецФункции
